# Sorting Data

In [29]:
people = {
    "Name" : ["Jafar","Surya","Vikram"],
    "No"   : [10,20,30],
    "Mail" : ["shaikmohammadhussain999@gmail.com","Surya@gmail.com","Vikram@gmail.com"]
}

In [30]:
import pandas as pd

In [31]:
df = pd.DataFrame(people)

In [32]:
df

     Name  No                               Mail
0   Jafar  10  shaikmohammadhussain999@gmail.com
1   Surya  20                    Surya@gmail.com
2  Vikram  30                   Vikram@gmail.com

In [33]:
df.sort_values(by='Mail')

     Name  No                               Mail
1   Surya  20                    Surya@gmail.com
2  Vikram  30                   Vikram@gmail.com
0   Jafar  10  shaikmohammadhussain999@gmail.com

In [34]:
df.sort_values(by=['No','Name'],ascending=False)

     Name  No                               Mail
2  Vikram  30                   Vikram@gmail.com
1   Surya  20                    Surya@gmail.com
0   Jafar  10  shaikmohammadhussain999@gmail.com

In [35]:
df.sort_values(by=['No','Name'],ascending=[False,True],inplace=True)
df

     Name  No                               Mail
2  Vikram  30                   Vikram@gmail.com
1   Surya  20                    Surya@gmail.com
0   Jafar  10  shaikmohammadhussain999@gmail.com

In [36]:
df.sort_index()

     Name  No                               Mail
0   Jafar  10  shaikmohammadhussain999@gmail.com
1   Surya  20                    Surya@gmail.com
2  Vikram  30                   Vikram@gmail.com

In [37]:
df['Name'].sort_values()

0     Jafar
1     Surya
2    Vikram
Name: Name, dtype: object